app/Controllers/Emprestimo.php

    public function index(){
        $emprestimo = $this->EmprestimoModel->findAll();
        $livro = $this->livroModel->findAll();
        $dadosobra = $this->obraModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $usuario = $this->usuarioModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `livro`
SELECT *
FROM `obra`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`

    public function cadastrar()
    {
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 0]);
---
INSERT INTO `emprestimo` (`data_inicio`, `data_prazo`, `id_livro`, `id_aluno`, `id_usuario`) VALUES ('2024-06-01', '10', '31', '27', '46')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('31')

    public function editar($id)
    {
        $dados = $this->EmprestimoModel->find($id);
        $dadosaluno = $this->alunoModel->findAll();
        $dadosobra = $this->obraModel->findAll();
        $dadosusuario = $this->usuarioModel->findAll();
        $dadoslivro = $this->livroModel->findAll();
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '97'
SELECT *
FROM `aluno`
SELECT *
FROM `obra`
SELECT *
FROM `usuario`
SELECT *
FROM `livro`

    public function salvar(){
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
        $this->livroModel->update($dados['id_livro_antigo'],['disponivel' => 1]);
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 0]);
---
UPDATE `emprestimo` SET `data_inicio` = '2024-06-01', `data_fim` = '2024-06-19', `data_prazo` = '10', `id_livro` = '31', `id_aluno` = '27', `id_usuario` = '46'
WHERE `emprestimo`.`id` IN ('97')
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('31')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('31')

    public function excluir(){
        $dados = $this->request->getPost();
        $this->livroModel->update($dados['id_livro'], ['disponivel' => 1]);
        $this->EmprestimoModel->delete($dados);
---
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('31')
DELETE FROM `emprestimo`
WHERE `id` IN ('96','31')